Revit 2026 API

# AnalyticalNodeDataGetAnalyticalNodeData Method

---

Returns AnalyticalNodeData associated with this element, if it exists.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AnalyticalNodeData GetAnalyticalNodeData(
	Element element
)
```
```vb
Public Shared Function GetAnalyticalNodeData (
	element As Element
) As AnalyticalNodeData
```
```cpp
public:
static AnalyticalNodeData^ GetAnalyticalNodeData(
	Element^ element
)
```
```fsharp
static member GetAnalyticalNodeData :
        element : Element -> AnalyticalNodeData
```

#### Parameters

element Element
     The element from which we try to obtain AnalyticalNodeData.

#### Return Value

AnalyticalNodeData

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the input element doesn't have AnalyticalNodeData than it retuns . The input element should be a ReferencePoint.

#### Reference

AnalyticalNodeData Class

Autodesk.Revit.DB.Structure Namespace